performance/taurus/4/BlazeExample.yml
---
execution:
- concurrency: 1
  hold-for: 2m
  ramp-up: 40s
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com
    - body:
        fromPort: Paris
        toPort: Buenos Aires
      label: reserve
      method: POST
      url: http://blazdemo.com/reserve.php
reporting:
   - module: blazemeter
     test: Smoke Test